Revit 2024 API
TrussCurveType Enumeration
Types of curves created in truss families.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum TrussCurveType
Visual Basic
Public Enumeration TrussCurveType
Visual C++
public enum class TrussCurveType
Members
Member name | Description
NonTrussCurve
TopChord
BottomChord
Web
See Also
Autodesk.Revit.DB.Structure Namespace